{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 7], "W_regularizer": null, "input_dim": 7, "init": "glorot_uniform", "name": "dense_1", "bias": true, "output_dim": 25, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "output_dim": 1, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_2"}}]}