{"config": [{"config": {"input_length": null, "input_dim": 1, "U_regularizer": null, "trainable": true, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "unroll": false, "batch_input_shape": [null, null, 1], "b_regularizer": null, "name": "lstm_1", "activation": "tanh", "consume_less": "cpu", "go_backwards": false, "forget_bias_init": "one", "stateful": false, "init": "glorot_uniform", "return_sequences": false, "input_dtype": "float32", "output_dim": 19, "W_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}, "class_name": "LSTM"}, {"config": {"W_constraint": null, "activation": "linear", "input_dim": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "bias": true, "name": "dense_1", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}