{"config": [{"config": {"init": "glorot_uniform", "output_dim": 13, "b_regularizer": null, "inner_activation": "hard_sigmoid", "U_regularizer": null, "input_dim": 1, "forget_bias_init": "one", "unroll": false, "activation": "tanh", "batch_input_shape": [null, null, 1], "dropout_W": 0.0, "input_dtype": "float32", "dropout_U": 0.0, "consume_less": "cpu", "trainable": true, "inner_init": "orthogonal", "return_sequences": true, "input_length": null, "W_regularizer": null, "name": "lstm_1", "stateful": false, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "dropout_U": 0.0, "output_dim": 5, "U_regularizer": null, "trainable": true, "b_regularizer": null, "inner_activation": "hard_sigmoid", "stateful": false, "inner_init": "orthogonal", "input_dim": 13, "return_sequences": false, "go_backwards": false, "input_length": null, "consume_less": "cpu", "forget_bias_init": "one", "W_regularizer": null, "name": "lstm_2", "unroll": false, "dropout_W": 0.0, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "W_constraint": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "bias": true, "W_regularizer": null, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}